Revit 2027 API
BuiltInFailures.RebarFailures.RebarInvalidDiameterRemoved Property
 Invalid RebarBarType was removed on upgrade.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarInvalidDiameterRemoved { get; }
Public Shared ReadOnly Property RebarInvalidDiameterRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarInvalidDiameterRemoved {
	FailureDefinitionId^ get ();
}
static member RebarInvalidDiameterRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace